app/Livewire/CommentPost.php

    public function storeComment()
    {
        $this->validate();

        // Crear el comentario
        Comment::create([
            'user_id' => auth()->user()->id,
            'post_id' => $this->post->id,
            'comment' => $this->comment,
        ]);
---
insert into `comments` (`user_id`, `post_id`, `comment`, `updated_at`, `created_at`) values (2, 21, 'holaaa', '2024-01-10 20:26:52', '2024-01-10 20:26:52')