app/Livewire/LikePost.php

delete from `likes` where `likes`.`post_id` = 12 and `likes`.`post_id` is not null and `user_id` = 2
---
    public function like()
    {
        if ($this->post->checkLike(auth()->user())) {
            $this->post->likes()->where('user_id', auth()->user()->id)->delete();