app/Livewire/LoadPost.php

    public function updated()
    {
        $this->post = Post::with(['comments' => function ($query) {
            $query->orderBy('created_at', 'desc');
        }])->find($this->post->id);
---
select * from `comments` where `comments`.`post_id` in (28) order by `created_at` desc