app/Livewire/LoadComments.php

    public function loadComments()
    {
        $this->comments = Comment::with('user')
            ->where('post_id', $this->post->id)
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `comments` where `post_id` = 37 order by `created_at` desc
select * from `users` where `users`.`id` in (1)