app/Http/Controllers/CommentController.php

insert into `comments` (`user_id`, `post_id`, `comment`, `updated_at`, `created_at`) values (2, 13, 'wenas', '2024-01-10 19:40:13', '2024-01-10 19:40:13')
---
    public function store(Request $request, User $user, Post $post) {
        // Validar
        $this->validate($request, [
            'comment' => ['required', 'max:255']
        ]);
        // Almacenar el resultado
        Comment::create([
            'user_id'=>auth()->user()->id,
            'post_id'=> $post->id,
            'comment'=>$request->comment
        ]);