app/Http/Controllers/FollowerController.php

insert into `followers` (`follower_id`, `user_id`) values (2, 2)
---
    public function store(User $user)
    {
        if (auth()->user()->id === $user->id) {
            return back()->withErrors(['error' => 'You cannot follow yourself.']);
        }

        $user->followers()->attach(auth()->user()->id);