app/Http/Controllers/HomeController.php

    public function __invoke()
    {
        $followingIds = auth()->user()->followings->pluck('id')->toArray();
        $posts = Post::with(['user', 'likes', 'comments'])
            ->whereIn('user_id', $followingIds)
            ->latest()
            ->paginate(5);
---
select * from `posts` where `user_id` in (1, 2) order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `posts` where `user_id` in (1, 2)