app/Http/Controllers/PerfilController.php

    public function index()
    {
        $user = User::find(auth()->user()->id);
---
select * from `users` where `users`.`id` = 2 limit 1

    public function update(Request $request)
    {
        $request->validate([
            'username' => [
                'required',
                'min:3',
                'max:20',
                'unique:users,username,' . auth()->user()->id,
                'not_in:admin,twitter,facebook,instagram,github,linkedin,gitlab,profile',
            ],
            'image' => ['image', 'max:4048', 'mimes:jpg,jpeg,png,gif', 'dimensions:min_width=240,min_height=240'],
        ]);

        $user = User::find(auth()->user()->id);
---
select * from `users` where `users`.`id` = 2 limit 1


        // Guardar los cambios si el usuario ha cambiado algo
        if ($user->isDirty()) {
            $user->save();
---
update `users` set `image` = 'b839ee87-6f65-4973-8f98-b967e330048a.jpg', `users`.`updated_at` = '2024-01-10 21:23:34' where `id` = 2