app/Http/Controllers/PostController.php

    public function index(User $user)
    {
        $posts  = Post::where('user_id', $user->id)->orderBy('created_at', 'desc')->get();
---
select * from `posts` where `user_id` = 2 order by `created_at` desc

    public function store(Request $request)
    {
        $this->validate($request, [
            'title' => ['required', 'max:255'],
            'image' => ['required']
        ]);

        Post::create([
            'title' => '',
            'text' => $request->title,
            'image' => $request->image,
            'user_id' => auth()->user()->id
        ]);
---
insert into `posts` (`title`, `text`, `image`, `user_id`, `updated_at`, `created_at`) values ('', 'sd', 'c5d9f52e-ad8e-405e-b87c-a69feece106b.jpg', 2, '2024-01-10 20:38:52', '2024-01-10 20:38:52')

    public function destroy(Post $post)
    {
        $this->authorize('delete', $post);
        $post->delete();
---
delete from `posts` where `id` = 9